app/Controllers/Categorias.php

SELECT *
FROM `categoria`
---
        public function index() {

            //chamar uma view que exibe todas as categorias
            $categoriaModel = new \App\Models\CategoriaModel();
            //armazena todos os registros da tabela
            $data['categorias'] = $categoriaModel->find();

INSERT INTO `categoria` (`nome`) VALUES ('Fábio Junior Alves')
---
        public function cadastrar()
        {
            $data['titulo'] = 'Inserir nova categoria';
            $data['acao'] = 'Inserir';
            $data['msg'] = '';
            $data['erros'] = '';

            //avaliar se o formulário foi submetido
            if($this->request->getPost()){

                $categoriaModel = new \App\Models\CategoriaModel();
                $categoriaModel->set('nome', $this->request->getPost('nome'));

                if($categoriaModel->insert()){