app/Controllers/Produtos.php

SELECT *
FROM `produto`
---
    public function index()
    {

        //chamar uma view que exibe todas as categorias
        $ProdutoModel = new \App\Models\ProdutoModel();
        //armazena todos os registros da tabela
        $data['produtos'] = $ProdutoModel->find();

SELECT *
FROM `categoria`
INSERT INTO `produto` (`nome`, `valor`, `categoria_id`) VALUES ('Corrente', '50', '3')
---
    public function cadastrar()
    {
        $data['titulo'] = 'Inserir novo produto';
        $data['acao'] = 'Inserir';
        $data['msg'] = '';
        $data['erros'] = '';

        $categoriaModel = new \App\Models\CategoriaModel();
        $data['listaCategorias'] = $categoriaModel->findAll();

        //avaliar se o formulário foi submetido
        if ($this->request->getPost()) {

            $produtoModel = new \App\Models\ProdutoModel();
            $dadosProduto = $this->request->getPost();

            if ($produtoModel->insert($dadosProduto)) {

DELETE FROM `produto`
WHERE `id` IN ('6')
---
    public function excluir($id = null)
    {

        $data['titulo'] = 'Excluir categoria';
        $data['msg'] = '';

        $produtoModel = new \App\Models\ProdutoModel();

        if ($produtoModel->delete($id)) {